config/emacs-config-new.el
(if (window-system)
    (tool-bar-mode t))
(menu-bar-mode -1)
(show-paren-mode 1)
(setq uniquify-buffer-name-style t)
(setq uniquify-buffer-name-style (quote post-forward))
(setq uniquify-min-dir-content 1)

(setq TeX-command-list
      (quote (
              ("TeX" "tex \\\\nonstopmode\\\\input %t" TeX-run-TeX nil t)
              ("LaTeX" "%l -shell-escape \\\\nonstopmode\\\\input{%t}" TeX-run-LaTeX nil t)
              ("LaTeX PDF" "pdflatex -shell-escape \\\\nonstopmode\\\\input{%t}" TeX-run-LaTeX nil t)
              ("View" "%v" TeX-run-discard nil nil)
              ("Print" "gsview32 %f" TeX-run-command t nil)
              ("File" "dvips %d -o %f " TeX-run-command t nil)
              ("BibTeX" "bibtex %s"</FONT> TeX-run-BibTeX nil nil)
              ("Index" "makeindex %s" TeX-run-command nil t)
              ("Check" "lacheck %s" TeX-run-compile nil t)
              ("Other" "" TeX-run-command t t))))

(require 'package)

(add-to-list 'package-archives
             '("marmalade" . "https://marmalade-repo.org/packages/"))
(add-to-list 'package-archives
             '("melpa" . "https://melpa.org/packages/"))
(add-to-list 'package-archives
             '("elpa" . "https://elpa.gnu.org/packages/"))
(add-to-list 'package-archives
             '("org" . "https://orgmode.org/elpa/"))

(package-initialize)

(require 'use-package)

(require 'load-path-config)

(use-package js-comint
  :ensure t
  :init
  (setq inferior-js-program-command "node")
  :bind
  (("\C-x\C-e" . js-send-last-sexp)
   ("\C-\M-x"  . js-send-last-sexp-and-go)
   ("\C-cb"    . js-send-buffer)
   ("\C-c\C-b" . js-send-buffer-and-go)
   ("\C-cl"    . js-load-file-and-go))
  )

(provide 'emacs-config-new)
